//
//  Shas.swift
//  daf-yomi
//
//  Created by Yehuda Neufeld on 29/03/2024.
//

import Foundation

class Shas {
    static let tractates: [String: Int] = [
        "ברכות": 63,
        "שבת": 157,
        "עירובין": 104,
        "פסחים": 121,
        "שקלים": 22,
        "ימא": 87,
        "סוכה": 55,
        "ביצה": 40,
        "ראש השנה": 35,
        "תענית": 31,
        "מגילה": 31,
        "מועד קטן": 28,
        "חגיגה": 27,
        "יבמות": 122,
        "כתובות": 112,
        "נדרים": 91,
        "נזיר": 66,
        "סוטה": 49,
        "גיטין": 90,
        "קידושין": 82,
        "בבא קמא": 118,
        "בבא מציעא": 119,
        "בבא בתרא": 176,
        "סנהדרין": 112,
        "מכות": 24,
        "שבועות": 49,
        "עבודה זרה": 76,
        "הוריות": 13,
        "זבחים": 120,
        "מנחות": 110,
        "חולין": 142,
        "בכורות": 61,
        "ערכין": 34,
        "תמורה": 33,
        "כריתות": 27,
        "מעילה": 26,
        "תמיד": 9,
        "נידה": 73,
    ]
}
